In [1]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

In [3]:
# Create the students table
c.execute('''
CREATE TABLE students (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    major TEXT
);
''')
# Create the courses table
c.execute('''
CREATE TABLE courses (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL
);
''')
# Create the enrollments table
c.execute('''
CREATE TABLE enrollments (
    enrollment_id INTEGER PRIMARY KEY,
    student_id INTEGER,
    course_id INTEGER,
    FOREIGN KEY (student_id) REFERENCES students (student_id),
    FOREIGN KEY (course_id) REFERENCES courses (course_id)
);
''')
# Create the exams table
c.execute('''
CREATE TABLE exams (
    exam_id INTEGER PRIMARY KEY,
    enrollment_id INTEGER,
    score INTEGER,
    FOREIGN KEY (enrollment_id) REFERENCES enrollments (enrollment_id)
);
''')

In [5]:
values = [(None,'Rachel',22, "geometry"),(None,'Janet',25, "english"),(None,'Jim',22, "cartography"),(None,'Steve',27, "math"),(None,'Heather',23, "maths"),(None,'Andrew',19, "cartography"),(None,'Angela',21, "english"),(None,'Geoff',22, "art"),(None,'Mary',37, "geography"),(None,'James',29, "physics"),(None,'Fred',25, "philosophy"),(None,'Brenda',22, "math"),(None,'Tim',22, "art"),(None,'Stu',24, "physics"),(None,'Carl',17, "cartography"),(None,'Janice',19, "english"),(None,'Linda',26, "law"),(None,'Sarah',32, "geography")]
c.executemany("INSERT INTO students (student_id, name, age, major) VALUES (?, ?, ?, ?)", values)
conn.commit

In [6]:
all_students=c.execute("SELECT student_id, name, age, major FROM students")
all_students.fetchall()

[(1, 'Rachel', 22, 'geometry'),
 (2, 'Janet', 25, 'english'),
 (3, 'Jim', 22, 'cartography'),
 (4, 'Steve', 27, 'math'),
 (5, 'Heather', 23, 'maths'),
 (6, 'Andrew', 19, 'cartography'),
 (7, 'Angela', 21, 'english'),
 (8, 'Geoff', 22, 'art'),
 (9, 'Mary', 37, 'geography'),
 (10, 'James', 29, 'physics'),
 (11, 'Fred', 25, 'philosophy'),
 (12, 'Brenda', 22, 'math'),
 (13, 'Tim', 22, 'art'),
 (14, 'Stu', 24, 'physics'),
 (15, 'Carl', 17, 'cartography'),
 (16, 'Janice', 19, 'english'),
 (17, 'Linda', 26, 'law'),
 (18, 'Sarah', 32, 'geography')]

In [8]:
courses = [(None, "algebra_101"),(None, "algebra_201"),(None,"mapping_101"),(None,"mapping_202"),(None,"intro_law"),(None, "physics_301"),(None, "algebra_101"),(None, "stats_201"),(None, "english_400"),(None, "triganometry_202"),(None, "intro_painting"),(None, "literature_301")]
c.executemany("INSERT INTO courses (course_id, course_name) VALUES (?, ?)", courses)
conn.commit

In [11]:
course_list =c.execute('SELECT course_id, course_name FROM courses')
course_list.fetchall()

[(1, 'algebra_101'),
 (2, 'algebra_201'),
 (3, 'mapping_101'),
 (4, 'mapping_202'),
 (5, 'intro_law'),
 (6, 'physics_301'),
 (7, 'algebra_101'),
 (8, 'stats_201'),
 (9, 'english_400'),
 (10, 'triganometry_202'),
 (11, 'intro_painting'),
 (12, 'literature_301')]

In [22]:
enrollment = [(1,3),(2,2),(2,4),(2,8),(3,1),(3,10),(3,11),(4,3),(4,5),(4,8),(5,7),(5,1),(5,3),(6,9),(6,2),(6,7),(7,2),(7,12),(7,8),(8,4),(8,3),(8,11),(9,1),(9,6),(9,12),(10,12),(10,8),(10,7),(11,5),(11,8),(11,3),(12,2),(12,1),(12,3),(13,9),(13,10),(13,4),(14,7),(14,6),(14,11),(15,6),(15,5),(15,2),(16,7),(16,2),(16,11),(17,2),(17,3),(17,5),(18,2),(18,5),(18,3)]
c.executemany("INSERT INTO enrollments (student_id, course_id) VALUES (?, ?)", enrollment)
conn.commit

In [23]:
enrollment_list =c.execute('SELECT enrollment_id, student_id, course_id FROM enrollments')
enrollment_list.fetchall()

[(1, 1, 1),
 (2, 1, 2),
 (3, 1, 3),
 (4, 2, 2),
 (5, 2, 4),
 (6, 2, 8),
 (7, 3, 1),
 (8, 3, 10),
 (9, 3, 11),
 (10, 4, 3),
 (11, 4, 5),
 (12, 4, 8),
 (13, 5, 7),
 (14, 5, 1),
 (15, 5, 3),
 (16, 6, 9),
 (17, 6, 2),
 (18, 6, 7),
 (19, 7, 2),
 (20, 7, 12),
 (21, 7, 8),
 (22, 8, 4),
 (23, 8, 3),
 (24, 8, 11),
 (25, 9, 1),
 (26, 9, 6),
 (27, 9, 12),
 (28, 10, 12),
 (29, 10, 8),
 (30, 10, 7),
 (31, 11, 5),
 (32, 11, 8),
 (33, 11, 3),
 (34, 12, 2),
 (35, 12, 1),
 (36, 12, 3),
 (37, 13, 9),
 (38, 13, 10),
 (39, 13, 4),
 (40, 14, 7),
 (41, 14, 6),
 (42, 14, 11),
 (43, 15, 6),
 (44, 15, 5),
 (45, 15, 2),
 (46, 16, 7),
 (47, 16, 2),
 (48, 16, 11),
 (49, 17, 2),
 (50, 17, 3),
 (51, 17, 5),
 (52, 18, 2),
 (53, 18, 5),
 (54, 18, 3)]

In [25]:
import random
exam = [(i, random.randint(65, 100)) for i in range(1, 57)]
c.executemany("INSERT INTO exams (enrollment_id, score) VALUES (?, ?)", exam)
conn.commit

In [27]:
exam_list =c.execute('SELECT exam_id, enrollment_id, score FROM exams')
exam_list.fetchall()

[(1, 1, 71),
 (2, 2, 71),
 (3, 3, 67),
 (4, 4, 79),
 (5, 5, 98),
 (6, 6, 89),
 (7, 7, 78),
 (8, 8, 68),
 (9, 9, 87),
 (10, 10, 71),
 (11, 11, 79),
 (12, 12, 85),
 (13, 13, 89),
 (14, 14, 92),
 (15, 15, 79),
 (16, 16, 77),
 (17, 17, 67),
 (18, 18, 81),
 (19, 19, 73),
 (20, 20, 72),
 (21, 21, 83),
 (22, 22, 92),
 (23, 23, 70),
 (24, 24, 82),
 (25, 25, 96),
 (26, 26, 78),
 (27, 27, 81),
 (28, 28, 93),
 (29, 29, 74),
 (30, 30, 66),
 (31, 31, 67),
 (32, 32, 73),
 (33, 33, 88),
 (34, 34, 80),
 (35, 35, 89),
 (36, 36, 83),
 (37, 37, 80),
 (38, 38, 95),
 (39, 39, 94),
 (40, 40, 81),
 (41, 41, 98),
 (42, 42, 89),
 (43, 43, 97),
 (44, 44, 91),
 (45, 45, 97),
 (46, 46, 94),
 (47, 47, 79),
 (48, 48, 98),
 (49, 49, 75),
 (50, 50, 77),
 (51, 51, 66),
 (52, 52, 91),
 (53, 53, 97),
 (54, 54, 79),
 (55, 55, 79),
 (56, 56, 100)]

In [32]:
math_students = c.execute("SELECT name, major FROM students WHERE major = 'math'")
conn.commit
math_students.fetchall()

In [33]:
math_students.fetchall()

[('Steve', 'math'), ('Brenda', 'math')]

In [40]:
major_students = '''SELECT COUNT(student_id), major 
                    FROM students 
                    GROUP BY major;'''
c.execute(major_students)
conn.commit
major_students=c.fetchall()
major_students

[(2, 'art'),
 (3, 'cartography'),
 (3, 'english'),
 (2, 'geography'),
 (1, 'geometry'),
 (1, 'law'),
 (2, 'math'),
 (1, 'maths'),
 (1, 'philosophy'),
 (2, 'physics')]

In [42]:
query = '''SELECT major,min(age),max(age) 
                    FROM students 
                    GROUP BY major;'''
c.execute(query)
conn.commit
age=c.fetchall()
age

[('art', 22, 22),
 ('cartography', 17, 22),
 ('english', 19, 25),
 ('geography', 32, 37),
 ('geometry', 22, 22),
 ('law', 26, 26),
 ('math', 22, 27),
 ('maths', 23, 23),
 ('philosophy', 25, 25),
 ('physics', 24, 29)]

In [44]:
query = '''SELECT major,count(age) as student_count,avg(age) as student_age
                    FROM students 
                    GROUP BY major;'''
c.execute(query)
conn.commit
age=c.fetchall()
age

[('art', 2, 22.0),
 ('cartography', 3, 19.333333333333332),
 ('english', 3, 21.666666666666668),
 ('geography', 2, 34.5),
 ('geometry', 1, 22.0),
 ('law', 1, 26.0),
 ('math', 2, 24.5),
 ('maths', 1, 23.0),
 ('philosophy', 1, 25.0),
 ('physics', 2, 26.5)]

In [46]:
query = '''SELECT name
            FROM students 
            WHERE student_id not in (select student_id from enrollments);'''
c.execute(query)
conn.commit
result=c.fetchall()
result

[]